app/controllers/lists_controller.rb

SELECT * FROM `lists` WHERE (`lists`.`id` = 1 AND (`lists`.project_id = 4))
---
def show

	#@project = Project.find(params[:project_id])
	@list = @project.lists.find(params[:id])

INSERT INTO `lists` (`position`, `title_textilized`, `created_at`, `title`, `project_id`, `updated_at`, `created_by`, `description_textilized`, `category_id`, `description`) VALUES(NULL, NULL, '2009-09-05 10:49:00', 'primera lista', 4, '2009-09-05 10:49:00', NULL, NULL, NULL, NULL)
---
def create
        puts 'dentro del create controlador de list'
	#@project = Project.find(params[:project_id])
	@list = @project.lists.build(params[:list])
	if @list.save

SELECT * FROM `lists` WHERE (`lists`.`id` = 2 AND (`lists`.project_id = 4))
---
def edit
	#@project = Project.find(params[:project_id])
	@list = @project.lists.find(params[:id])

SELECT * FROM `lists` WHERE (`lists`.`id` = 1 AND (`lists`.project_id = 4))
UPDATE `lists` SET `updated_at` = '2009-09-11 22:14:38', `description` = 'por fin primera tarea' WHERE `id` = 10
---
def update
	#@project = Project.find(params[:project_id])
	@list = @project.lists.find(params[:id])

	if @list.update_attributes(params[:list])

SELECT * FROM `lists` WHERE (`lists`.`id` = 3 AND (`lists`.project_id = 4))
DELETE FROM `lists` WHERE `id` = 3
---
def destroy
	#@project = Project.find(params[:project_id])
	@list = @project.lists.find(params[:id])
	@list.destroy