app/controllers/projects_controller.rb

INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `url`, `logo_file_name`, `logo_content_type`, `logo_file_size`) VALUES('primer projecto', '2009-09-03 19:53:57', '2009-09-03 19:53:57', 'url del primer proyecto', '', '', 67)
---
 def create
    @project = Project.new(params[:project])


    respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `updated_at` = '2009-09-03 19:56:02', `name` = 'Primer projecto' WHERE `id` = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])