app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1 AND (`tasks`.list_id = 10))
---
def show

	#@project = Project.find(params[:project_id])
	#@list = @project.lists.find(params[:list_id])
	@task = @list.tasks.find(params[:id])

INSERT INTO `tasks` (`position`, `cost_type`, `created_at`, `cost`, `updated_at`, `description_textilized`, `list_id`, `description`) VALUES(NULL, NULL, '2009-09-11 22:56:55', NULL, '2009-09-11 22:56:55', NULL, 10, 'uyuhouh')
---
def create
 puts 'EStoy en task create controler'
	#@project = Project.find(params[:project_id])

	#@list = List.find(params[:list_id])
	@task = @list.tasks.build(params[:task])
	if @task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 4 AND (`tasks`.list_id = 11))
---
def edit
	#@project = Project.find(params[:project_id])
        #@list = @project.find(params[:list_id])
	@task = @list.tasks.find(params[:id])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 7 AND (`tasks`.list_id = 14))
DELETE FROM `tasks` WHERE `id` = 7
---
def destroy
	#@project = Project.find(params[:project_id])
        #@list = @project.find(params[:list_id])
	@tasks = @list.tasks.find(params[:id])
	@tasks.destroy